Autodesk.Revit.DB.TessellatedShapeBuilder.CreateMeshByExtrusion(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.ElementId)
Builds a mesh by extruding curve loop(s) along extrusion
distance.
Remarks:
This function supports creation of a mesh given a collection
of continuous curve loops, which are processed independently
from each other. Loops with gaps or with curves with
wrong flips will be split before processing.
profileLoops:
The profile loops to be extruded. The loops will not be modified.
extrusionDirection:
Direction of extrusion. The length of this vector is ignored.
extrusionDistance:
The positive distance by which the loops are extruded in the
direction of the input extrusionDir.
materialId:
Material which should be used by a constructed mesh.
Returns:
Returns a mesh, which was constructed, and some additional
information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value cannot be used as thickness for an extrusion,
or blend, or wall layer, or similar geometric construct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
extrusionDirection has zero length.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.Build(Autodesk.Revit.DB.TessellatedShapeBuilderTarget,Autodesk.Revit.DB.TessellatedShapeBuilderFallback,Autodesk.Revit.DB.ElementId)
Builds the designated geometrical objects from the stored face sets.
Remarks:
Currently only "Solid/Abort", "AnyGeometry/Mesh" and
"Mesh/Salvage" target/fallback combinations are supported.
Note that this function does not erase the face sets stored in the builder.
If the same builder is used to construct geometrical objects for different
collections of face sets, (Autodesk.Revit.DB.TessellatedShapeBuilder.Clear) should be called
while switching from one collection to another.
target:
What kind of geometrical object(s) should be built.
fallback:
What should be done if a GeometryObject described by the 'target'
parameter cannot be built using all data from all stored face sets.
graphicsStyleId:
The id of the graphics style for the created geometrical objects.
Pass InvalidElementId to skip assigning a custom graphics style.
Returns:
Returns the geometrical objects which were built
and some additional information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This combination of fallback and target parameters
cannot be used as a valid combination of inputs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if data in the stored face sets are so inconsistent, that
they cannot be used in their entirety.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014